      program main 


!torch_bridge_fortran 被写成了module，方便在其他程序中调用
!其中使用者可以把它当成黑箱，深度学习训练好的模型被封装在其中
!需要输入的是一个二维数组，x_array(cesm_m,ncol),cesm_m 是因子个数
!ncol和cesm的ncol是一致的。输出的y_cesm就是深度模型的计算量
!x1, i --|              ______
!x2, i --|             |     |     
!x3, i --|---------->  | box | ------->  y_cesm(i)
!x4, i --|             |_____|
!x5, i --|              

!这是cesm中调用TBF的一个实例程序，在bridge程序中，计算被进行
!参数传递的过程在bridge进行，
!参数优化的过程则是在python文件夹下进行
!计算过程则主要写在calculation.f90中，这一部分不建议修改，需要对深度模型很了解
!文件读取在file_io.f90中进行
!----------------------------------------------------------------

!在fortran模型代码中，我们主要需要做下面几件事


!1.use module 

        use bridge , only: tbf
         

!-----------------------------------------------------------------

!2.申明变量和变量的维度

        implicit none 
        integer              :: m = 4
        real,allocatable     :: x_array(:,:)
        real                 :: y_cesm(5)
        character(len = 100) :: dirname ="/data/chengxl/&
                         pblh_deeplearning/torch_bridge_fortran/python/"
 
!-----------------------------------------------------------------

!3.明确自变量（可以通过其他函数传递）!如果多个变量向量则需要进行数组拼接
        allocate(x_array(m,5))

        x_array(:,1) = (/264.32004,0.3210011,14510.625,52310.562/)
        x_array(:,2) = (/264.31717,0.32086015,14449.125,52227.875/)
        x_array(:,3) = (/264.31717,0.32067218,14449.125,52186.5/)
        x_array(:,4) = (/264.31573,0.3205077,14449.125,52062.375/)
        x_array(:,5) = (/264.31573,0.3203667,14387.5,51979.688/)

!------------------------------------------------------------------

!4.调用子程序tbf( 数组长度，因子个数，自变量数组, 预报量数组)
!增加功能，传进去一个路径参数使得这个tbf能够被多次调用

        call tbf(dirname,5,m,x_array,y_cesm)

!------------------------------------------------------------------

!5.检查和传递计算结果

        print*,y_cesm 

!-------------------------------------------------------------------
        print*,"测试"
      end program main 
